/* Создайте объект obj. Выведите на экран элемент с ключом 'c' двумя способами:
 через квадратные скобки и как свойство объекта:  */
 /* let obj = {
     a : 1,
     b : 2,
     c : 3
 };
 alert(obj.c);
 alert(obj["c"]); */

/*  Создайте массив заработных плат obj. Выведите на экран зарплату Пети и Коли.  */

/* let obj = {
    "Kolya" : 23000,
    "Piter" : 12450
}
alert(obj.Kolya + " " + obj.Piter); */

/* Создайте объект с днями недели. Ключами в нем должны служить номера дней от начала недели
 (понедельник - первый и т.д.). Выведите на экран текущий день недели.  */

/*  let obj = {
    1 : "monday",
    2 : "tuestay",
    3 : "wednesday",
    4 : "thursday",
    5 : "friday",
    6 : "saturday",
    7 : "sunday",
};

alert(obj["6"]); */


/*  Пусть теперь номер дня недели хранится в переменной day, например там лежит число 3.
  Выведите день недели, соответствующий значению переменной day.  */

  /*  let obj = {
     1 : "monday",
     2 : "tuestay",
     3 : "wednesday",
     4 : "thursday",
     5 : "friday",
     6 : "saturday",
     7 : "sunday",
 };
 
 let day = prompt("What is day today? (number)" , "");
 alert(obj[day]); */