/* Даны два массива: [1, 2, 3] и [4, 5, 6]. Объедините их вместе.  */

/* let arr =[1, 2, 3],
arr1 = [4, 5, 6];
alert(arr.concat(arr1)); */

/* Дан массив [1, 2, 3]. Сделайте из него массив [3, 2, 1].  */

/* let arr = [1, 2, 3];
alert(arr.reverse()); */

/* Дан массив [1, 2, 3]. Добавьте ему в конец элементы 4, 5, 6.

Дан массив [1, 2, 3]. Добавьте ему в начало элементы 4, 5, 6. */

/* let arr = [1, 2, 3];

alert(arr.push(4, 5, 6));
alert(arr.unshift(4, 5, 6)); */

/* Дан массив ['js', 'css', 'jq']. Выведите на экран первый элемент и последний.  */

/* let arr = ['js', 'css', 'jq']; 
alert(arr.shift());
alert(arr.pop()); */

/* Дан массив [1, 2, 3, 4, 5]. С помощью метода slice запишите в новый элементы [4, 5]. 
 */

 /* let arr = [1, 2, 3, 4, 5];
 alert(arr.slice(3)); */

/*  Дан массив [1, 2, 3, 4, 5]. С помощью метода splice сделайте из него массив [1, 'a', 'b', 2, 3, 4, 'c', 5, 'e'].  */

/* let arr = [1, 2, 3, 4, 5];
let arr2 = arr.splice(1,5,'a', 'b', 2, 3, 4, 'c', 5, 'e');
alert(arr); */

/* Дан массив [3, 4, 1, 2, 7]. Отсортируйте его.  */

/* let arr = [3, 4, 1, 2, 7];
alert(arr.sort()); */

/* Дан объект {js:'test', jq: 'hello', css: 'world'}. Получите массив его ключей.  */

let obj = {
    js:'test',
    jq: 'hello',
    css: 'world'
}
for (let key in obj) {
    alert(key);
}