/* Даны переменные a = 10 и b = 3. Найдите остаток от деления a на b */
/* let a = 10,
b = 3;
alert( a % b); */
/* Даны переменные a и b. Проверьте, что a делится без остатка на b.
 Если это так - выведите 'Делится' и результат деления, 
 иначе выведите 'Делится с остатком' и остаток от деления. */
 /* let a,
 b;
 a = +prompt("your number 1");
 b = +prompt("your number 2");
 if (a % b == 0) {
     alert("делится");
 }
 else {
     alert("делится с остатком");
 } */
 /* Возведите 2 в 10 степень. Результат запишите в переменную st. */
 /* alert (Math.pow(2,5)); */
/*  Найдите квадратный корень из 245. */
/* alert(Math.sqrt(245)); */