/* Выведите столбец чисел от 1 до 100. */
/* let i;
for ( i=0;i<=99;i++)
{
    document.write(i + "<br>")
} */
/* Выведите столбец чисел от 11 до 33. */
/* let i=11;
while (i<=33)
{
    document.write(i + "<br>");
    i++;
} */
/* Выведите столбец четных чисел в промежутке от 0 до 100. */
/* let i;
for (i =0; i<=100; i++)
{
    if(i % 2 ==0)
    {
        document.write(i + "<br>");
    }
} */
/* С помощью цикла найдите сумму чисел от 1 до 100. */
let i,
sum=0;
for (i = 1; i <= 100; i++)
{
    sum = sum + i;
}
document.write(sum);