// Создайте переменную num и присвойте ей значение 3. Выведите значение этой переменной на экран с помощью метода alert.
/* let num = 3;
alert (num) */
// Создайте переменные a=10 и b=2. Выведите на экран их сумму, разность, произведение и частное (результат деления).
/* let a = 10,
b = 2;
alert (a + b);
alert (a - b);
alert (a * b);
alert (a / b); */
// Создайте переменные c=15 и d=2. Просуммируйте их, а результат присвойте переменной result. Выведите на экран значение переменной result.
/* let c = 15,
d = 2,
result = 0;
result = c + d;
alert(result); */
//Создайте переменные a=10, b=2 и c=5. Выведите на экран их сумму.
/* let a = 10,
b = 2,
c = 5;
alert(a + b + c); */
/* Создайте переменные a=17 и b=10. Отнимите от a переменную b и результат присвойте переменной c.
 Затем создайте переменную d, присвойте ей значение 7. Сложите переменные c и d,
  а результат запишите в переменную result. Выведите на экран значение переменной result. */
 /*  let a = 17,
  b = 10,
  c = 0,
  d = 7,
  result = 0;
  c = a -b;
  result = c + d;
  alert(result); */
  //Создайте переменную str и присвойте ей значение 'Привет, Мир!'. Выведите значение этой переменной на экран.
/*   let str = " Hello, world! ";
  alert (str); */
 /*  Создайте переменные str1='Привет, ' и str2='Мир!'. 
  С помощью этих переменных и операции сложения строк выведите на экран фразу 'Привет, Мир!'. */
/*   let str1 = "hello, ",
  str2 ="world! ";
  alert(str1 + str2); */
  //Создайте переменную name и присвойте ей ваше имя. Выведите на экран фразу 'Привет, %Имя%!'.
  /* let name = "Igor";
  alert("hello, " + name +"!"); */
 // Создайте переменную age и присвойте ей ваш возраст. Выведите на экран 'Мне %Возраст% лет!'.
 /* let age = 21;
 alert("Мне " + age + " лет!"); */
 //Спросите имя пользователя с помощью методы prompt. Выведите с помощью alert сообщение 'Ваше имя %имя%'.
/*   let name;
  name = prompt("Как вас зовут?");
  alert("Ваше имя " + name); */
  // Спросите у пользователя число. Выведите с помощью alert квадрат этого числа.
 /*  let num;
  num = +prompt("Введите число");
  alert(num + " В Квадрате = " + num*num); */
/*   Создайте переменную str и присвойте ей значение 'abcde'. 
  Обращаясь к отдельным символам этой строки выведите на экран символ 'a', символ 'c', символ 'e'. */
 /*  let str = "abcde";
  alert(str[0] + ", " + str[2] + ", " + str[4]); */

  //Создайте переменную num и присвойте ей значение '12345'. Найдите произведение (умножение) цифр этого числа.
  /* let num = "12345",
  result;
  result = num[0] * num[1] * num[2] * num[3] * num[4];
  alert(result); */
  // Напишите скрипт, который считает количество секунд в часе, в сутках, в месяце.
  /* alert("Количество секунд в часе "+ 60*60);
  alert("Количество секунд в сутках "+ 60*60*24);
  alert("Количество секунд в месяце "+ 60*60*24*31); */
 // Создайте три переменные - час, минута, секунда. С их помощью выведите текущее время в формате 'час:минута:секунда'.
 /* let hours = 10,
 min = 34,
 sec = 12;
 alert(hours + ":"+ min + ":" + sec); */
 //Создайте переменную, присвойте ей число. Возведите это число в квадрат. Выведите его на экран.
/*  let number;
 number = +prompt("Введите число");
 alert(number*number); */
/*  Переделайте этот код так, чтобы в нем использовались операции +=, -=, *=, /=. Количество строк кода при этом не должно измениться.

var num = 47;
num = num + 7;
num = num - 18;
num = num * 10;
num = num / 15;
alert(num); */

/* var num = 47;
num += 7;
num -= 18;
num *=  10;
num /=  15;
alert(num); */

/* Переделайте этот код так, чтобы в нем использовались операции ++ и --. Количество строк кода при этом не должно измениться.

var num = 10;
num = num + 1;
num = num + 1;
num = num - 1;
alert(num); */

/* var num = 10;
++num;
num++;
num--;
alert(num); */


